Repository: LinHXiang/Retrace
Catalog: Retrace/Settings/IntegrationSettings.xcstrings
Source language: en
Languages: es, fr, ja, ko, pt_br, zh_hans, zh_hant

source: Install zsh integration
es: Instalar integración de zsh
fr: Installer l’intégration zsh
ja: zsh 連携をインストール
ko: zsh 통합 설치
pt_br: Instalar integração do zsh
zh_hans: 安装 zsh 集成
zh_hant: 安裝 zsh 整合

# Title
source: Integration
es: Integración
fr: Intégration
ja: 連携
ko: 통합
pt_br: Integração
zh_hans: 集成
zh_hant: 整合

source: zsh integration
es: Integración de zsh
fr: Intégration zsh
ja: zsh 連携
ko: zsh 통합
pt_br: Integração do zsh
zh_hans: zsh 集成
zh_hant: zsh 整合

# ZshIntegrationExplanationFile
source: Commands are written to ~/Library/Application Support/Retrace/zsh_history; ~/.zsh_history is not changed.
es: Los comandos se escriben en ~/Library/Application Support/Retrace/zsh_history; ~/.zsh_history no se modifica.
fr: Les commandes sont écrites dans ~/Library/Application Support/Retrace/zsh_history; ~/.zsh_history n’est pas modifié.
ja: コマンドは ~/Library/Application Support/Retrace/zsh_history に書き込まれ、~/.zsh_history は変更されません。
ko: 명령은 ~/Library/Application Support/Retrace/zsh_history에 기록되며 ~/.zsh_history는 변경되지 않습니다.
pt_br: Os comandos são gravados em ~/Library/Application Support/Retrace/zsh_history; ~/.zsh_history não é alterado.
zh_hans: 命令会写入 ~/Library/Application Support/Retrace/zsh_history，不会修改 ~/.zsh_history。
zh_hant: 命令會寫入 ~/Library/Application Support/Retrace/zsh_history，不會修改 ~/.zsh_history。

# ZshIntegrationExplanationHook
source: Retrace adds a small marked hook to ~/.zshrc.
es: Retrace añade un pequeño hook marcado a ~/.zshrc.
fr: Retrace ajoute un petit hook balisé dans ~/.zshrc.
ja: Retrace は ~/.zshrc に小さなマーク付きフックを追加します。
ko: Retrace는 ~/.zshrc에 표시된 작은 훅을 추가합니다.
pt_br: O Retrace adiciona um pequeno hook marcado ao ~/.zshrc.
zh_hans: Retrace 会在 ~/.zshrc 添加一段带标记的轻量 hook。
zh_hant: Retrace 會在 ~/.zshrc 加入一段帶標記的輕量 hook。

# ZshIntegrationExplanationTiming
source: The hook runs before each zsh command and records the command.
es: El hook se ejecuta antes de cada comando de zsh y registra el comando.
fr: Le hook s’exécute avant chaque commande zsh et enregistre la commande.
ja: このフックは各 zsh コマンドの前に実行され、コマンドを記録します。
ko: 이 훅은 각 zsh 명령 전에 실행되어 명령을 기록합니다.
pt_br: O hook roda antes de cada comando zsh e registra o comando.
zh_hans: hook 会在每条 zsh 命令执行前运行，并记录这条命令。
zh_hant: hook 會在每條 zsh 命令執行前執行，並記錄這條命令。

# ZshIntegrationExplanationTitle
source: Explanation
es: Explicación
fr: Explication
ja: 説明
ko: 설명
pt_br: Explicação
zh_hans: 说明
zh_hant: 說明

source: zsh integration installed
es: Integración de zsh instalada
fr: Intégration zsh installée
ja: zsh 連携はインストール済み
ko: zsh 통합 설치됨
pt_br: Integração do zsh instalada
zh_hans: 已安装 zsh 集成
zh_hant: 已安裝 zsh 整合

source: zsh integration not installed
es: Integración de zsh no instalada
fr: Intégration zsh non installée
ja: zsh 連携は未インストール
ko: zsh 통합이 설치되지 않음
pt_br: Integração do zsh não instalada
zh_hans: 未安装 zsh 集成
zh_hant: 未安裝 zsh 整合

# ZshIntegrationPrompt
source: After installing zsh integration, Retrace immediately records terminal commands in real time.
es: Después de instalar la integración de zsh, Retrace registra de inmediato los comandos del terminal en tiempo real.
fr: Après l’installation de l’intégration zsh, Retrace enregistre immédiatement les commandes du terminal en temps réel.
ja: zsh 連携をインストールすると、Retrace はターミナルコマンドをすぐにリアルタイムで記録します。
ko: zsh 통합을 설치하면 Retrace가 터미널 명령을 즉시 실시간으로 기록합니다.
pt_br: Depois de instalar a integração do zsh, o Retrace registra imediatamente os comandos do Terminal em tempo real.
zh_hans: 安装 zsh 集成后，Retrace 马上实时记录终端命令。
zh_hant: 安裝 zsh 整合後，Retrace 會馬上即時記錄終端命令。
